# SeparatorItem Class

---
A class representing a context menu separator.
SystemObject Autodesk.Revit.UIMenuItem Autodesk.Revit.UISeparatorItem
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SeparatorItem : MenuItem

    Public Class SeparatorItem
    	Inherits MenuItem

    public ref class SeparatorItem : public MenuItem

    type SeparatorItem =
        class
            inherit MenuItem
        end
The SeparatorItem type exposes the following members.
| Name| Description
---|---|---
| SeparatorItem|  Default constructor.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from MenuItem)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from MenuItem)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
A separator can be added between menu items when needed.
#### Reference
Autodesk.Revit.UI Namespace